; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p14---int100n150-m25---int100c200---s424---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level13 level13)
(sum level0 level18 level18)
(sum level0 level19 level19)
(sum level0 level25 level25)
(sum level1 level3 level4)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level13 level14)
(sum level1 level18 level19)
(sum level1 level19 level20)
(sum level1 level25 level26)
(sum level2 level3 level5)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level13 level15)
(sum level2 level18 level20)
(sum level2 level19 level21)
(sum level2 level25 level27)
(sum level3 level3 level6)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level13 level16)
(sum level3 level18 level21)
(sum level3 level19 level22)
(sum level3 level25 level28)
(sum level4 level3 level7)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level13 level17)
(sum level4 level18 level22)
(sum level4 level19 level23)
(sum level4 level25 level29)
(sum level5 level3 level8)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level13 level18)
(sum level5 level18 level23)
(sum level5 level19 level24)
(sum level5 level25 level30)
(sum level6 level3 level9)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level13 level19)
(sum level6 level18 level24)
(sum level6 level19 level25)
(sum level6 level25 level31)
(sum level7 level3 level10)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level13 level20)
(sum level7 level18 level25)
(sum level7 level19 level26)
(sum level7 level25 level32)
(sum level8 level3 level11)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level13 level21)
(sum level8 level18 level26)
(sum level8 level19 level27)
(sum level8 level25 level33)
(sum level9 level3 level12)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level13 level22)
(sum level9 level18 level27)
(sum level9 level19 level28)
(sum level9 level25 level34)
(sum level10 level3 level13)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level13 level23)
(sum level10 level18 level28)
(sum level10 level19 level29)
(sum level10 level25 level35)
(sum level11 level3 level14)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level13 level24)
(sum level11 level18 level29)
(sum level11 level19 level30)
(sum level11 level25 level36)
(sum level12 level3 level15)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level13 level25)
(sum level12 level18 level30)
(sum level12 level19 level31)
(sum level12 level25 level37)
(sum level13 level3 level16)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level13 level26)
(sum level13 level18 level31)
(sum level13 level19 level32)
(sum level13 level25 level38)
(sum level14 level3 level17)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level13 level27)
(sum level14 level18 level32)
(sum level14 level19 level33)
(sum level14 level25 level39)
(sum level15 level3 level18)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level13 level28)
(sum level15 level18 level33)
(sum level15 level19 level34)
(sum level15 level25 level40)
(sum level16 level3 level19)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level13 level29)
(sum level16 level18 level34)
(sum level16 level19 level35)
(sum level16 level25 level41)
(sum level17 level3 level20)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level13 level30)
(sum level17 level18 level35)
(sum level17 level19 level36)
(sum level17 level25 level42)
(sum level18 level3 level21)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level13 level31)
(sum level18 level18 level36)
(sum level18 level19 level37)
(sum level18 level25 level43)
(sum level19 level3 level22)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level13 level32)
(sum level19 level18 level37)
(sum level19 level19 level38)
(sum level19 level25 level44)
(sum level20 level3 level23)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level13 level33)
(sum level20 level18 level38)
(sum level20 level19 level39)
(sum level20 level25 level45)
(sum level21 level3 level24)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level13 level34)
(sum level21 level18 level39)
(sum level21 level19 level40)
(sum level21 level25 level46)
(sum level22 level3 level25)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level13 level35)
(sum level22 level18 level40)
(sum level22 level19 level41)
(sum level22 level25 level47)
(sum level23 level3 level26)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level13 level36)
(sum level23 level18 level41)
(sum level23 level19 level42)
(sum level23 level25 level48)
(sum level24 level3 level27)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level13 level37)
(sum level24 level18 level42)
(sum level24 level19 level43)
(sum level24 level25 level49)
(sum level25 level3 level28)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level13 level38)
(sum level25 level18 level43)
(sum level25 level19 level44)
(sum level25 level25 level50)
(sum level26 level3 level29)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level13 level39)
(sum level26 level18 level44)
(sum level26 level19 level45)
(sum level26 level25 level51)
(sum level27 level3 level30)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level13 level40)
(sum level27 level18 level45)
(sum level27 level19 level46)
(sum level27 level25 level52)
(sum level28 level3 level31)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level13 level41)
(sum level28 level18 level46)
(sum level28 level19 level47)
(sum level28 level25 level53)
(sum level29 level3 level32)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level13 level42)
(sum level29 level18 level47)
(sum level29 level19 level48)
(sum level29 level25 level54)
(sum level30 level3 level33)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level13 level43)
(sum level30 level18 level48)
(sum level30 level19 level49)
(sum level30 level25 level55)
(sum level31 level3 level34)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level13 level44)
(sum level31 level18 level49)
(sum level31 level19 level50)
(sum level31 level25 level56)
(sum level32 level3 level35)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level13 level45)
(sum level32 level18 level50)
(sum level32 level19 level51)
(sum level32 level25 level57)
(sum level33 level3 level36)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level13 level46)
(sum level33 level18 level51)
(sum level33 level19 level52)
(sum level33 level25 level58)
(sum level34 level3 level37)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level13 level47)
(sum level34 level18 level52)
(sum level34 level19 level53)
(sum level34 level25 level59)
(sum level35 level3 level38)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level13 level48)
(sum level35 level18 level53)
(sum level35 level19 level54)
(sum level35 level25 level60)
(sum level36 level3 level39)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level13 level49)
(sum level36 level18 level54)
(sum level36 level19 level55)
(sum level36 level25 level61)
(sum level37 level3 level40)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level13 level50)
(sum level37 level18 level55)
(sum level37 level19 level56)
(sum level37 level25 level62)
(sum level38 level3 level41)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level13 level51)
(sum level38 level18 level56)
(sum level38 level19 level57)
(sum level38 level25 level63)
(sum level39 level3 level42)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level13 level52)
(sum level39 level18 level57)
(sum level39 level19 level58)
(sum level39 level25 level64)
(sum level40 level3 level43)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level13 level53)
(sum level40 level18 level58)
(sum level40 level19 level59)
(sum level40 level25 level65)
(sum level41 level3 level44)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level13 level54)
(sum level41 level18 level59)
(sum level41 level19 level60)
(sum level41 level25 level66)
(sum level42 level3 level45)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level13 level55)
(sum level42 level18 level60)
(sum level42 level19 level61)
(sum level42 level25 level67)
(sum level43 level3 level46)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level13 level56)
(sum level43 level18 level61)
(sum level43 level19 level62)
(sum level43 level25 level68)
(sum level44 level3 level47)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level13 level57)
(sum level44 level18 level62)
(sum level44 level19 level63)
(sum level44 level25 level69)
(sum level45 level3 level48)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level13 level58)
(sum level45 level18 level63)
(sum level45 level19 level64)
(sum level45 level25 level70)
(sum level46 level3 level49)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level13 level59)
(sum level46 level18 level64)
(sum level46 level19 level65)
(sum level46 level25 level71)
(sum level47 level3 level50)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level13 level60)
(sum level47 level18 level65)
(sum level47 level19 level66)
(sum level47 level25 level72)
(sum level48 level3 level51)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level48 level13 level61)
(sum level48 level18 level66)
(sum level48 level19 level67)
(sum level48 level25 level73)
(sum level49 level3 level52)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level49 level13 level62)
(sum level49 level18 level67)
(sum level49 level19 level68)
(sum level49 level25 level74)
(sum level50 level3 level53)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level50 level13 level63)
(sum level50 level18 level68)
(sum level50 level19 level69)
(sum level50 level25 level75)
(sum level51 level3 level54)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level51 level13 level64)
(sum level51 level18 level69)
(sum level51 level19 level70)
(sum level51 level25 level76)
(sum level52 level3 level55)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level52 level13 level65)
(sum level52 level18 level70)
(sum level52 level19 level71)
(sum level52 level25 level77)
(sum level53 level3 level56)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level53 level13 level66)
(sum level53 level18 level71)
(sum level53 level19 level72)
(sum level53 level25 level78)
(sum level54 level3 level57)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level54 level13 level67)
(sum level54 level18 level72)
(sum level54 level19 level73)
(sum level54 level25 level79)
(sum level55 level3 level58)
(sum level55 level6 level61)
(sum level55 level8 level63)
(sum level55 level13 level68)
(sum level55 level18 level73)
(sum level55 level19 level74)
(sum level55 level25 level80)
(sum level56 level3 level59)
(sum level56 level6 level62)
(sum level56 level8 level64)
(sum level56 level13 level69)
(sum level56 level18 level74)
(sum level56 level19 level75)
(sum level56 level25 level81)
(sum level57 level3 level60)
(sum level57 level6 level63)
(sum level57 level8 level65)
(sum level57 level13 level70)
(sum level57 level18 level75)
(sum level57 level19 level76)
(sum level57 level25 level82)
(sum level58 level3 level61)
(sum level58 level6 level64)
(sum level58 level8 level66)
(sum level58 level13 level71)
(sum level58 level18 level76)
(sum level58 level19 level77)
(sum level58 level25 level83)
(sum level59 level3 level62)
(sum level59 level6 level65)
(sum level59 level8 level67)
(sum level59 level13 level72)
(sum level59 level18 level77)
(sum level59 level19 level78)
(sum level59 level25 level84)
(sum level60 level3 level63)
(sum level60 level6 level66)
(sum level60 level8 level68)
(sum level60 level13 level73)
(sum level60 level18 level78)
(sum level60 level19 level79)
(sum level60 level25 level85)
(sum level61 level3 level64)
(sum level61 level6 level67)
(sum level61 level8 level69)
(sum level61 level13 level74)
(sum level61 level18 level79)
(sum level61 level19 level80)
(sum level61 level25 level86)
(sum level62 level3 level65)
(sum level62 level6 level68)
(sum level62 level8 level70)
(sum level62 level13 level75)
(sum level62 level18 level80)
(sum level62 level19 level81)
(sum level62 level25 level87)
(sum level63 level3 level66)
(sum level63 level6 level69)
(sum level63 level8 level71)
(sum level63 level13 level76)
(sum level63 level18 level81)
(sum level63 level19 level82)
(sum level63 level25 level88)
(sum level64 level3 level67)
(sum level64 level6 level70)
(sum level64 level8 level72)
(sum level64 level13 level77)
(sum level64 level18 level82)
(sum level64 level19 level83)
(sum level64 level25 level89)
(sum level65 level3 level68)
(sum level65 level6 level71)
(sum level65 level8 level73)
(sum level65 level13 level78)
(sum level65 level18 level83)
(sum level65 level19 level84)
(sum level65 level25 level90)
(sum level66 level3 level69)
(sum level66 level6 level72)
(sum level66 level8 level74)
(sum level66 level13 level79)
(sum level66 level18 level84)
(sum level66 level19 level85)
(sum level66 level25 level91)
(sum level67 level3 level70)
(sum level67 level6 level73)
(sum level67 level8 level75)
(sum level67 level13 level80)
(sum level67 level18 level85)
(sum level67 level19 level86)
(sum level67 level25 level92)
(sum level68 level3 level71)
(sum level68 level6 level74)
(sum level68 level8 level76)
(sum level68 level13 level81)
(sum level68 level18 level86)
(sum level68 level19 level87)
(sum level68 level25 level93)
(sum level69 level3 level72)
(sum level69 level6 level75)
(sum level69 level8 level77)
(sum level69 level13 level82)
(sum level69 level18 level87)
(sum level69 level19 level88)
(sum level69 level25 level94)
(sum level70 level3 level73)
(sum level70 level6 level76)
(sum level70 level8 level78)
(sum level70 level13 level83)
(sum level70 level18 level88)
(sum level70 level19 level89)
(sum level70 level25 level95)
(sum level71 level3 level74)
(sum level71 level6 level77)
(sum level71 level8 level79)
(sum level71 level13 level84)
(sum level71 level18 level89)
(sum level71 level19 level90)
(sum level71 level25 level96)
(sum level72 level3 level75)
(sum level72 level6 level78)
(sum level72 level8 level80)
(sum level72 level13 level85)
(sum level72 level18 level90)
(sum level72 level19 level91)
(sum level72 level25 level97)
(sum level73 level3 level76)
(sum level73 level6 level79)
(sum level73 level8 level81)
(sum level73 level13 level86)
(sum level73 level18 level91)
(sum level73 level19 level92)
(sum level73 level25 level98)
(sum level74 level3 level77)
(sum level74 level6 level80)
(sum level74 level8 level82)
(sum level74 level13 level87)
(sum level74 level18 level92)
(sum level74 level19 level93)
(sum level74 level25 level99)
(sum level75 level3 level78)
(sum level75 level6 level81)
(sum level75 level8 level83)
(sum level75 level13 level88)
(sum level75 level18 level93)
(sum level75 level19 level94)
(sum level75 level25 level100)
(sum level76 level3 level79)
(sum level76 level6 level82)
(sum level76 level8 level84)
(sum level76 level13 level89)
(sum level76 level18 level94)
(sum level76 level19 level95)
(sum level76 level25 level101)
(sum level77 level3 level80)
(sum level77 level6 level83)
(sum level77 level8 level85)
(sum level77 level13 level90)
(sum level77 level18 level95)
(sum level77 level19 level96)
(sum level77 level25 level102)
(sum level78 level3 level81)
(sum level78 level6 level84)
(sum level78 level8 level86)
(sum level78 level13 level91)
(sum level78 level18 level96)
(sum level78 level19 level97)
(sum level78 level25 level103)
(sum level79 level3 level82)
(sum level79 level6 level85)
(sum level79 level8 level87)
(sum level79 level13 level92)
(sum level79 level18 level97)
(sum level79 level19 level98)
(sum level79 level25 level104)
(sum level80 level3 level83)
(sum level80 level6 level86)
(sum level80 level8 level88)
(sum level80 level13 level93)
(sum level80 level18 level98)
(sum level80 level19 level99)
(sum level80 level25 level105)
(sum level81 level3 level84)
(sum level81 level6 level87)
(sum level81 level8 level89)
(sum level81 level13 level94)
(sum level81 level18 level99)
(sum level81 level19 level100)
(sum level81 level25 level106)
(sum level82 level3 level85)
(sum level82 level6 level88)
(sum level82 level8 level90)
(sum level82 level13 level95)
(sum level82 level18 level100)
(sum level82 level19 level101)
(sum level82 level25 level107)
(sum level83 level3 level86)
(sum level83 level6 level89)
(sum level83 level8 level91)
(sum level83 level13 level96)
(sum level83 level18 level101)
(sum level83 level19 level102)
(sum level83 level25 level108)
(sum level84 level3 level87)
(sum level84 level6 level90)
(sum level84 level8 level92)
(sum level84 level13 level97)
(sum level84 level18 level102)
(sum level84 level19 level103)
(sum level84 level25 level109)
(sum level85 level3 level88)
(sum level85 level6 level91)
(sum level85 level8 level93)
(sum level85 level13 level98)
(sum level85 level18 level103)
(sum level85 level19 level104)
(sum level85 level25 level110)
(sum level86 level3 level89)
(sum level86 level6 level92)
(sum level86 level8 level94)
(sum level86 level13 level99)
(sum level86 level18 level104)
(sum level86 level19 level105)
(sum level86 level25 level111)
(sum level87 level3 level90)
(sum level87 level6 level93)
(sum level87 level8 level95)
(sum level87 level13 level100)
(sum level87 level18 level105)
(sum level87 level19 level106)
(sum level87 level25 level112)
(sum level88 level3 level91)
(sum level88 level6 level94)
(sum level88 level8 level96)
(sum level88 level13 level101)
(sum level88 level18 level106)
(sum level88 level19 level107)
(sum level88 level25 level113)
(sum level89 level3 level92)
(sum level89 level6 level95)
(sum level89 level8 level97)
(sum level89 level13 level102)
(sum level89 level18 level107)
(sum level89 level19 level108)
(sum level89 level25 level114)
(sum level90 level3 level93)
(sum level90 level6 level96)
(sum level90 level8 level98)
(sum level90 level13 level103)
(sum level90 level18 level108)
(sum level90 level19 level109)
(sum level90 level25 level115)
(sum level91 level3 level94)
(sum level91 level6 level97)
(sum level91 level8 level99)
(sum level91 level13 level104)
(sum level91 level18 level109)
(sum level91 level19 level110)
(sum level91 level25 level116)
(sum level92 level3 level95)
(sum level92 level6 level98)
(sum level92 level8 level100)
(sum level92 level13 level105)
(sum level92 level18 level110)
(sum level92 level19 level111)
(sum level92 level25 level117)
(sum level93 level3 level96)
(sum level93 level6 level99)
(sum level93 level8 level101)
(sum level93 level13 level106)
(sum level93 level18 level111)
(sum level93 level19 level112)
(sum level93 level25 level118)
(sum level94 level3 level97)
(sum level94 level6 level100)
(sum level94 level8 level102)
(sum level94 level13 level107)
(sum level94 level18 level112)
(sum level94 level19 level113)
(sum level94 level25 level119)
(sum level95 level3 level98)
(sum level95 level6 level101)
(sum level95 level8 level103)
(sum level95 level13 level108)
(sum level95 level18 level113)
(sum level95 level19 level114)
(sum level95 level25 level120)
(sum level96 level3 level99)
(sum level96 level6 level102)
(sum level96 level8 level104)
(sum level96 level13 level109)
(sum level96 level18 level114)
(sum level96 level19 level115)
(sum level96 level25 level121)
(sum level97 level3 level100)
(sum level97 level6 level103)
(sum level97 level8 level105)
(sum level97 level13 level110)
(sum level97 level18 level115)
(sum level97 level19 level116)
(sum level97 level25 level122)
(sum level98 level3 level101)
(sum level98 level6 level104)
(sum level98 level8 level106)
(sum level98 level13 level111)
(sum level98 level18 level116)
(sum level98 level19 level117)
(sum level98 level25 level123)
(sum level99 level3 level102)
(sum level99 level6 level105)
(sum level99 level8 level107)
(sum level99 level13 level112)
(sum level99 level18 level117)
(sum level99 level19 level118)
(sum level99 level25 level124)
(sum level100 level3 level103)
(sum level100 level6 level106)
(sum level100 level8 level108)
(sum level100 level13 level113)
(sum level100 level18 level118)
(sum level100 level19 level119)
(sum level100 level25 level125)
(sum level101 level3 level104)
(sum level101 level6 level107)
(sum level101 level8 level109)
(sum level101 level13 level114)
(sum level101 level18 level119)
(sum level101 level19 level120)
(sum level101 level25 level126)
(sum level102 level3 level105)
(sum level102 level6 level108)
(sum level102 level8 level110)
(sum level102 level13 level115)
(sum level102 level18 level120)
(sum level102 level19 level121)
(sum level103 level3 level106)
(sum level103 level6 level109)
(sum level103 level8 level111)
(sum level103 level13 level116)
(sum level103 level18 level121)
(sum level103 level19 level122)
(sum level104 level3 level107)
(sum level104 level6 level110)
(sum level104 level8 level112)
(sum level104 level13 level117)
(sum level104 level18 level122)
(sum level104 level19 level123)
(sum level105 level3 level108)
(sum level105 level6 level111)
(sum level105 level8 level113)
(sum level105 level13 level118)
(sum level105 level18 level123)
(sum level105 level19 level124)
(sum level106 level3 level109)
(sum level106 level6 level112)
(sum level106 level8 level114)
(sum level106 level13 level119)
(sum level106 level18 level124)
(sum level106 level19 level125)
(sum level107 level3 level110)
(sum level107 level6 level113)
(sum level107 level8 level115)
(sum level107 level13 level120)
(sum level107 level18 level125)
(sum level107 level19 level126)
(sum level108 level3 level111)
(sum level108 level6 level114)
(sum level108 level8 level116)
(sum level108 level13 level121)
(sum level108 level18 level126)
(sum level109 level3 level112)
(sum level109 level6 level115)
(sum level109 level8 level117)
(sum level109 level13 level122)
(sum level110 level3 level113)
(sum level110 level6 level116)
(sum level110 level8 level118)
(sum level110 level13 level123)
(sum level111 level3 level114)
(sum level111 level6 level117)
(sum level111 level8 level119)
(sum level111 level13 level124)
(sum level112 level3 level115)
(sum level112 level6 level118)
(sum level112 level8 level120)
(sum level112 level13 level125)
(sum level113 level3 level116)
(sum level113 level6 level119)
(sum level113 level8 level121)
(sum level113 level13 level126)
(sum level114 level3 level117)
(sum level114 level6 level120)
(sum level114 level8 level122)
(sum level115 level3 level118)
(sum level115 level6 level121)
(sum level115 level8 level123)
(sum level116 level3 level119)
(sum level116 level6 level122)
(sum level116 level8 level124)
(sum level117 level3 level120)
(sum level117 level6 level123)
(sum level117 level8 level125)
(sum level118 level3 level121)
(sum level118 level6 level124)
(sum level118 level8 level126)
(sum level119 level3 level122)
(sum level119 level6 level125)
(sum level120 level3 level123)
(sum level120 level6 level126)
(sum level121 level3 level124)
(sum level122 level3 level125)
(sum level123 level3 level126)

(connected l0 l1)
(fuelcost level13 l0 l1)
(connected l0 l2)
(fuelcost level6 l0 l2)
(connected l0 l4)
(fuelcost level25 l0 l4)
(connected l1 l0)
(fuelcost level13 l1 l0)
(connected l1 l2)
(fuelcost level18 l1 l2)
(connected l1 l3)
(fuelcost level19 l1 l3)
(connected l2 l0)
(fuelcost level6 l2 l0)
(connected l2 l1)
(fuelcost level18 l2 l1)
(connected l2 l3)
(fuelcost level3 l2 l3)
(connected l2 l4)
(fuelcost level8 l2 l4)
(connected l3 l1)
(fuelcost level19 l3 l1)
(connected l3 l2)
(fuelcost level3 l3 l2)
(connected l4 l0)
(fuelcost level25 l4 l0)
(connected l4 l2)
(fuelcost level8 l4 l2)

(at t0 l4)
(fuel t0 level126)
(= (total-cost) 0)

(at p0 l2)
(at p1 l2)
(at p2 l3)
(at p3 l1)
(at p4 l3)
(at p5 l0)
(at p6 l4)
(at p7 l0)
(at p8 l3)
(at p9 l1)
(at p10 l3)
(at p11 l2)
(at p12 l3)
(at p13 l3)
)

(:goal
(and
(at p0 l0)
(at p1 l1)
(at p2 l2)
(at p3 l2)
(at p4 l4)
(at p5 l2)
(at p6 l2)
(at p7 l4)
(at p8 l4)
(at p9 l3)
(at p10 l4)
(at p11 l0)
(at p12 l0)
(at p13 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l4)
   deleted: (at p6 l4)
   added: (in p6 t0)
   goals met: 0 of 14
2. (drive t0 l4 l2 level118 level8 level126)
   deleted: (at t0 l4) (fuel t0 level126)
   added: (at t0 l2) (fuel t0 level118)
   goals met: 0 of 14
3. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 1 of 14
4. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 1 of 14
5. (drive t0 l2 l1 level100 level18 level118)
   deleted: (at t0 l2) (fuel t0 level118)
   added: (at t0 l1) (fuel t0 level100)
   goals met: 1 of 14
6. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 2 of 14
7. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 2 of 14
8. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 2 of 14
9. (drive t0 l1 l3 level81 level19 level100)
   deleted: (at t0 l1) (fuel t0 level100)
   added: (at t0 l3) (fuel t0 level81)
   goals met: 2 of 14
10. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 3 of 14
11. (load p8 t0 l3)
   deleted: (at p8 l3)
   added: (in p8 t0)
   goals met: 3 of 14
12. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 3 of 14
13. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 3 of 14
14. (load p13 t0 l3)
   deleted: (at p13 l3)
   added: (in p13 t0)
   goals met: 3 of 14
15. (load p12 t0 l3)
   deleted: (at p12 l3)
   added: (in p12 t0)
   goals met: 3 of 14
16. (load p10 t0 l3)
   deleted: (at p10 l3)
   added: (in p10 t0)
   goals met: 3 of 14
17. (drive t0 l3 l2 level78 level3 level81)
   deleted: (at t0 l3) (fuel t0 level81)
   added: (at t0 l2) (fuel t0 level78)
   goals met: 3 of 14
18. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 4 of 14
19. (load p11 t0 l2)
   deleted: (at p11 l2)
   added: (in p11 t0)
   goals met: 4 of 14
20. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 4 of 14
21. (drive t0 l2 l0 level72 level6 level78)
   deleted: (at t0 l2) (fuel t0 level78)
   added: (at t0 l0) (fuel t0 level72)
   goals met: 4 of 14
22. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 4 of 14
23. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 4 of 14
24. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 5 of 14
25. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 6 of 14
26. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 7 of 14
27. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 8 of 14
28. (drive t0 l0 l2 level66 level6 level72)
   deleted: (at t0 l0) (fuel t0 level72)
   added: (at t0 l2) (fuel t0 level66)
   goals met: 8 of 14
29. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 9 of 14
30. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 10 of 14
31. (drive t0 l2 l4 level58 level8 level66)
   deleted: (at t0 l2) (fuel t0 level66)
   added: (at t0 l4) (fuel t0 level58)
   goals met: 10 of 14
32. (unload p10 t0 l4)
   deleted: (in p10 t0)
   added: (at p10 l4)
   goals met: 11 of 14
33. (unload p4 t0 l4)
   deleted: (in p4 t0)
   added: (at p4 l4)
   goals met: 12 of 14
34. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 13 of 14
35. (unload p8 t0 l4)
   deleted: (in p8 t0)
   added: (at p8 l4)
   goals met: 14 of 14
